In [48]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
import numpy as np

In [49]:
df=pd.read_csv("data/raw/ChurnModelling_Raw_1.csv")
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42.00,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41.00,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42.00,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,38.91,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43.00,2,125510.82,1,1,1,79084.10,0

In [50]:
df_encord=df[["Geography","Gender"]]
encoder=OneHotEncoder(drop="first",sparse_output=False)

In [51]:

encoded_df=encoder.fit_transform(df_encord[["Geography","Gender"]])

In [52]:
encoded_df=pd.DataFrame(encoded_df,columns=encoder.get_feature_names_out(["Geography", "Gender"]))
encoded_df.head()

   Geography_Germany  Geography_Spain  Gender_Male
0                0.0              0.0          0.0
1                0.0              1.0          0.0
2                0.0              0.0          0.0
3                0.0              0.0          0.0
4                0.0              1.0          0.0

In [53]:
df=pd.concat([df,encoded_df],axis=1)

In [54]:
df

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_Germany,Geography_Spain,Gender_Male
0,619,France,Female,42.00,2,0.00,1,1,1,101348.88,1,0.0,0.0,0.0
1,608,Spain,Female,41.00,1,83807.86,1,0,1,112542.58,0,0.0,1.0,0.0
2,502,France,Female,42.00,8,159660.80,3,1,0,113931.57,1,0.0,0.0,0.0
3,699,France,Female,38.91,1,0.00,2,0,0,93826.63,0,0.0,0.0,0.0
4,850,Spain,Female,43.00,2,125510.82,1,1,1,79084.10,0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39.00,5,0.00,2,1,0,96270.64,0,0.0,0.0,1.0
9996,516,France,Male,35.00,10,57369.61,1,1,1,101699.77,0,0.0,0.0,1.0
9997,709,France,Female,36.00,7,0.00,1,0,1,42085.58,1,0.0,0.0,0.0
9998,772,Germany,Male,42.00,3,75075.31,2,1,0,92888.52,1,1.0,0.0,1.0
9999,792,France,Female,28.00,4,130142.79,1,1,0,38190.78,0,0.0,0.0,0.0

In [55]:
df.drop(columns=["Geography","Gender"],inplace=True)
from sklearn.preprocessing import StandardScaler

In [ ]:
def scale(df,columns):
    scaler=StandardScaler()
    df_col_to_scale=df[columns]
    df=df.drop(columns=columns,axis=1)
    df_col_to_scale=scaler.fit_transform(df_col_to_scale[columns])
    df_col_to_scale=pd.DataFrame(df_col_to_scale,columns=columns,index=df.index)
    df=pd.concat([df,df_col_to_scale],axis=1)
    print(df.head())

columns=["Age","Balance", "EstimatedSalary"]

In [57]:
scale(df,columns)

      CreditScore  Tenure  NumOfProducts  HasCrCard  IsActiveMember  Exited  \
0             619       2              1          1               1       1
1             608       1              1          0               1       0
2             502       8              3          1               0       1
3             699       1              2          0               0       0
4             850       2              1          1               1       0
...           ...     ...            ...        ...             ...     ...
9995          771       5              2          1               0       0
9996          516      10              1          1               1       0
9997          709       7              1          0               1       1
9998          772       3              2          1               0       1
9999          792       4              1          1               0       0

      Geography_Germany  Geography_Spain  Gender_Male       Age   Balance  \
0                   0.0              0.0          0.0  0.302983 -1.225848
1                   0.0              1.0          0.0  0.204867  0.117350
2                   0.0              0.0          0.0  0.302983  1.333053
3                   0.0              0.0          0.0 -0.000196 -1.225848
4                   0.0              1.0          0.0  0.401100  0.785728
...                 ...              ...          ...       ...       ...
9995                0.0              0.0          1.0  0.008634 -1.225848
9996                0.0              0.0          1.0 -0.383831 -0.306379
9997                0.0              0.0          0.0 -0.285715 -1.225848
9998                1.0              0.0          1.0  0.302983 -0.022608
9999                0.0              0.0          0.0 -1.070646  0.859965

      EstimatedSalary
0            0.021886
1            0.216534
2            0.240687
3           -0.108918
4           -0.365276
...               ...
9995        -0.066419
9996         0.027988
9997        -1.008643
9998        -0.125231
9999        -1.076370

[10000 rows x 12 columns]